{
  "users": [
    {
      "userName": "Amanda",
      "email": "amanda@live.com",
      "password": "puppy",
      "id": 1
    },
    {
      "email": "mark@mark.com",
      "userName": "Mark",
      "password": "87",
      "id": 2
    },
    {
      "email": "jason@jason.com",
      "userName": "Jason",
      "password": "jason",
      "id": 3
    },
    {
      "email": "king.amanda.r@gmail.com",
      "userName": "Tasha",
      "password": "nj",
      "id": 4
    },
    {
      "email": "mel@mel.com",
      "userName": "Mel",
      "password": "09",
      "id": 5
    }
  ],
  "recipes": [
    {
      "userId": 1,
      "id": 2,
      "title": "Crispy Vegan Smashed Potatoes with Chimichurri",
      "url": "https://www.veganricha.com/wp-content/uploads/2019/06/Vegan-smashed-Potatoes-with-Chimichurri-veganricha-0477.jpg",
      "recipe": "Ingredients\n\nFor the potatoes\n\n1.5 lb baby potatoes , Yukon gold or white or mix, see notes for regular size potatoes\n1 tbsp oil , olive oil or organic safflower or melted vegan butter\n1/2 tsp (0.5 tsp) coarse salt\n1/2 tsp (0.5 tsp) freshly ground black pepper\n\nFor the chimichurri\n\n1 cup (60 g) packed parsley or one bunch parsley leaves and tender stems, chopped\n1/4 cup (4 g) basil packed or use cilantro\n4 cloves (6 cloves) of raw garlic\n2 tbsp extra virgin olive oil\njuice of 1 lime\n1 tsp vinegar, apple cider or balsamic or red wine vinegar\n1/4 tsp (0.25 tsp) each salt and black pepper\n2 tbsp or more avocado for creaminess optional\n\nInstructions\n\nCook the potatoes: Add to a pressure cooker with enough water to cover the potatoes. Close the lid and pressure cook for 6 mins, let the pressure release naturally.\nSaucepan: Add potatoes and tap water(about an inch over the potatoes) to a saucepan. Bring to a boil over medium heat. Continue to cook for 25 mins or until tender. \nDrain the potatoes for 5 mins. Brush oil on baking sheet, place potatoes and press with fork or potato masher to flatten to about 1/4 inch thick.\nBrush oil on the potatoes. Sprinkle salt and pepper generously. (you can also add minced garlic and herbs). Bake at 400 deg F (205 C) for 25 to 30 mins.\nMeanwhile process the chimichurri ingredients in a food processor or blender with a few tbsp of water until coarsely blended. Taste and adjust flavor with salt, lime. \nTake the potatoes off the baking dish and serve hot, dressed with chimichurri.",
      "user": "Amanda"
    },
    {
      "userId": 1,
      "id": 3,
      "title": "Minestrone Soup",
      "url": "https://www.veganricha.com/wp-content/uploads/2016/12/minestrone-veganricha-7878.jpg",
      "recipe": "Ingredients\n\n1 tsp olive oil\n1/2 cup (80 g) chopped onion chopped\n4 cloves garlic chopped\n1/2 cup (50.5 g) chopped celery\n3/4 cup (96 g) chopped carrots\n28 oz (793.79 g) can diced tomato\n15 oz (425.24 g) can cannellini beans or other white beans or a combinationof white and kidney beans\n1 cup (124 g) chopped zucchini\n3 cups (750 ml) water\n1/2 tsp (0.5 tsp) salt\n1/2 tsp (0.5 tsp) oregano\n1/4 tsp (0.25 tsp) thyme\n1/4 tsp (0.25 tsp) black pepper\n1/2 cup (118.29 g) elbows or other pasta use gluten-free if needed\n1 cup (30 g) baby spinach\n3 tbsp chopped basil\nvegan Parmesan for garnish - optional\n\nInstructions\n\nHeat oil in a large saucepan over medium heat. Add onion and garlic and cook until translucent. 4 mins.\nAdd celery, carrots and tomato and bring to a boil. 4 to 5 mins.\nAdd the beans, zucchini, water, salt and spices and cook for 15 to 18 minutes.\nAdd 1/2 cup pasta and simmer for 12 or more minutes. Taste and adjust salt, herbs and heat.\nFold in spinach and 2 tbsp chopped basil and simmer for another minute. Serve hot garnished with fresh basil and vegan Parmesan.",
      "user": "Amanda"
    },
    {
      "userId": 1,
      "id": 4,
      "title": "Berry Crisp",
      "url": "https://www.cookingclassy.com/wp-content/uploads/2017/07/triple-berry-crisp-8.jpg",
      "recipe": "Ingredients\n\nFilling:\n\nBag of berries/ fruit—I like the mixed berries with cherries at aldi\n1/4 cup flour\nLittle bit of sugar like 1-2 tbsp or maple syrup-add more flour if you go that route or it will get liquidy\nLemon/lime juice-just a squirt for acidity\n\nTopping:\n\n1/2 Cup butter\n1/4 cup oats\n1/4 pecans or walnuts-chop them up a bit\n1/4 cup brown sugar\n1/4 cup flour plus more as needed\nInstructions:\n\nOven at 400\nMix up all the filling ingredients together in baking dish. I make sure the berries are coated with flour and there should be a little at the bottom to soak up berry juice\nMake sure butter is soft(vegan butter always is) mix in all the ingredients. If it’s is not crumbly then add a little more flour. You may need to add more of everything depending on how big the crisp is\nBake for at least 30 min. I usually go for forty if the berries are really frozen when it goes in. Sometime the top doesn’t brown well either so I’ll broil it for like 30 sec to a min\nLet it rest for ten before you eat it too so the juices will thicken up",
      "user": "Amanda"
    },
    {
      "userId": 1,
      "id": 5,
      "title": "Herby Mushroom Barley",
      "url": "https://i.pinimg.com/originals/11/f3/07/11f30781ae46d5515b133dcc2a955aa1.jpg",
      "recipe": "Ingredients\n\n1.5 cups pearl barley\n3 tablespoons Taiwanese Mushroom Powder-really  however much you want/ to taste\n4.5 cups water\n1 pound oyster mushrooms (cremini work too if you can’t find oyster. I would not use anything that was dried)\n3 tablespoons butter\n3 shallots sliced (can swap for half an onion and three cloves garlic)\n2 sprigs fresh rosemary (I use Italian seasoning when I don’t have fresh herbs around.)\n1/2 cup chopped parsley\n1/2 cup chopped cilantro\nJuice of half a lemon or lime\nSalt and pepper to taste\n\nDirections:\n\n1. Add barley, water, and mushroom seasoning to large pot. Bring to a boil. Once boiling cover and simmer for 30 minutes. Remove from heat once cooked. Drain if necessary.\n2. Heat skillet to medium high with some oil, add shallots and cook til browning (5-7 minutes). Remove from skillet.\n3. Add mushrooms with oil to skillet, season with salt and pepper. Cook until browning 5-7 minutes then add butter and rosemary. Cook until you feel like they are done (for me about 10 minutes. It’s really your own preference.)\n4. Combine mushrooms and shallots with barley. Add cilantro and parsley and squeeze lemon juice over. Stir until combined. Then serve.",
      "user": "Amanda"
    },
    {
      "userId": 1,
      "id": 6,
      "title": "Mushroom Bourginoun with Mashed Potatoes",
      "url": "https://www.veganricha.com/wp-content/uploads/2018/10/Vegan-Bourguignon-with-mushrooms-over-Cauliflower-mash-veganricha-9059.jpg",
      "recipe": "Ingredients\n\nMushroom Bourguignon:\n\n2 tsp oil\n1/2 (0.5 ) medium onion chopped\n4 cloves of garlic finely chopped\n10 oz (8 oz) sliced mushrooms mixed or white or cremini\n1/4 cup (58.75 ml) brandy or whiskey or red wine or use broth\n3/4 cup (75 g) chopped carrots\n1 cup (101 g) chopped celery\n3/4 tsp (0.75 tsp) dried thyme or 1 tbsp fresh\n1/4 tsp (0.25 tsp) garlic powder\n1 tbsp soy sauce ,tamari for gluten-free, coconut aminos for soyfree\n2 tsp tomato paste\n1/2 cup (125 ml) water or broth\n1 tbsp cornstarch or arrowroot starch mixed in 3 tbsp water (you can also add 2 tbsp of the mashed potato mixture to thicken)\n1 cup (30 g) of spinach or greens\n\nPotato Mash:\n\n2 large potato cubed small\n1 tbsp olive oil\n2 to 4 tbsp non dairy milk\n1/4 tsp (0.25 tsp) each salt garlic powder\nblack pepper to taste\n\nInstructions\n\nHeat the Instant Pot on Saute. Add oil. When the oil is hot, add the onion, garlic, mushrooms and a good pinch of salt and give them a quick mix. Cook for 3 to 4 minutes until golden on some edges. Add a tbsp of water if browning too quickly.\nAdd the wine and mix well for a few seconds to cook out the alcohol.\nAdd the carrots, celery, thyme and garlic and mix well. Add the soy sauce, tomato paste, 1/3 tsp salt (if using water or unsalted broth) and water/broth and give it a mix. Cancel saute. You can also add in 1 bay leaf and some rosemary for flavor variation at this point.\nPlace the steamer basket on top of the mushroom mixture. Add potato and cauliflower to it. \nClose the Instant Pot lid. Pressure Cook for 9 to 10 minutes (Manual hi pressure). Add a minute if using larger quantity of either mushroom mix or potatoes, or if doubling.\nLet the pressure release naturally once the cooking is complete. Open the lid and carefully remove the steamer basket.\nPut the pot on saute, Add cornstarch slurry and give it a mix (you can also add 2 tbsp of the mashed potato mixture to thicken). Add spinach or baby kale and black pepper and mix. Bring the mixture to a boil to thicken, then cancel saute. Taste and adjust salt and flavor.\nMeanwhile. Transfer the steamed potato to a bowl and mash roughly. Add garlic powder, salt, pepper, olive oil, non dairy milk  and optionally fresh/dried herbs of choice(eg. thyme, rosemary, chives) and mash well to preferred consistency. \nServe the mash layered with the mushroom bourguignon. Garnish with some fresh thyme or basil and black or white pepper.",
      "user": "Amanda"
    },
    {
      "userId": 3,
      "id": 7,
      "title": "Crunchy Tater Tot Burrito with Grilled Soy Curls and Peppers and Onions",
      "url": "https://i.pinimg.com/736x/d9/dd/9c/d9dd9cc0186c90e043bd8aff41d326bd--tater-tots-burritos.jpg",
      "recipe": "Ingredients \n1 bag frozen tater tots\n1 bag frozen roasted pepper and onion blend\n14 ounces soy curls\n1 can refried beans\n3 cloves garlic minced\n1 tbsp Cumin\n1 tbsp Chili powder\n1 tbsp neutral oil\n3 tbsp soy sauce\n1 tsp ground black pepper\n1/2 tsp paprika\n1/2 tsp cayenne pepper\n\n5 8\" Tortillas\n\nDirections\n\nPlace tater tots in air fryer on 400 F for ten minutes. Flip then repeat for 5 minutes.\nHeat skillet to med high heat with oil. add soy curls, peppers and onions and garlic. Cook for 4 minutes or until onions begin to turn translucent. \nAdd soy sauce and all seasoning with 1/4 C water cover skillet and turn head to medium low cook until water and soy sauce have evaporated.\n\nTo Assemble\n\nLayer refried beans with soy curls and veggies and place tater tots on top then wrap burrito and serve.\n",
      "user": "Jason"
    }
  ],
  "friends": [
    
  ]
}